tutorials/incompressibleVoF/rotatingCube/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  8;

decomposer      hierarchical;
distributor     hierarchical;

hierarchical
{
    n               (2 2 2);
    order           xyz;
}

constraints
{
    refinementHistory
    {
        type            refinementHistory;
    }
}

// ************************************************************************* //
